# Мини-домашка 2

In [ ]:
# Импортируйте библиотеку

In [1]:
# Загрузите данные
# Pandas - Q1 Sales.csv

In [2]:
# этот кусок сделает колонку с датой, разберитесь в нём
data['Date of Purchase'] = pd.to_datetime(data['Date of Purchase'])
data.head()

     Country Region Sales Person Date of Purchase   Total  Quantity
0      India  North         John       2012-02-01  100000       567
1         US  North         Bill       2012-04-16  120000      3000
2         UK  North       Thomas       2014-07-31  140000       345
3  Australia   East         John       2012-11-24  160000      1000
4     Africa   East         Bill       2012-06-11  180000       123

In [3]:
# год из конкретной даты можно вытащить вот так: 
data['year'] = data['Date of Purchase'].apply(lambda w: w.year)
data.head()

     Country Region Sales Person Date of Purchase   Total  Quantity  year
0      India  North         John       2012-02-01  100000       567  2012
1         US  North         Bill       2012-04-16  120000      3000  2012
2         UK  North       Thomas       2014-07-31  140000       345  2014
3  Australia   East         John       2012-11-24  160000      1000  2012
4     Africa   East         Bill       2012-06-11  180000       123  2012

__[1] Сколько уникальных Sales Person? (уникальность считается по паре страна, регион)__

In [ ]:
# Ваш код

__[1] В каком году было больше всего продаж? (Total)__

In [ ]:
# Ваш код

__[2]Нарисуйте barplot количества продаж (Total) по годам__

In [ ]:
# Ващ код

__[4] Сделайте min-max scaling столбца Total__

Структура min_max:

    min = минимальный элемент в столбце
    max = максимальный элемент в столбце
    
    x_new = (x-min)/(max-min)

In [ ]:
# Ващ код

__[2] Постройте график (barplot) для полученных в прошлом номере значений__

In [ ]:
# Ващ код

# Обратная связь

Задачи закончились! После выполнения и до отправки просьба оставить обратную связь по мини-домашке:

https://forms.gle/8eP68ttifsusKgzx8